*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0540                                             &*
*& Title       : [CO] BU 매핑정보 관리                                &*
*& Created By  : MDP_06                                               &*
*& Created On  : 2021.10.01                                           &*
*& Description : [CO] BU 매핑정보 관리                                &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2021.10.01  MDP_06      INITIAL RELEASE
* U    2022.02.22  MDP_06      사별 관리 및 이력조회 기능 추가
*----------------------------------------------------------------------*

REPORT ZCOR0540 MESSAGE-ID ZCO01.

INCLUDE ZCOR0540T01.   " TOP-Decration
INCLUDE ZCOR0540ALV.   " Class ALV OR Others
INCLUDE ZCOR0540SCR.   " Selection-Screen
INCLUDE ZCOR0540F01.   " Subroutine
INCLUDE ZCOR0540PBO.   " Process Before Output
INCLUDE ZCOR0540PAI.   " Process After  Input


*---------------------------------------------------------------------*
INITIALIZATION.
*---------------------------------------------------------------------*
  PERFORM INITIALIZATION.
  PERFORM SCRFIELDS_FUNCTXT.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND.

*--------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*--------------------------------------------------------------------*
  PERFORM SET_UPDATE_INFO.

*---------------------------------------------------------------------*
START-OF-SELECTION.
*---------------------------------------------------------------------*
  PERFORM SELECTED_DATA_RTN.

*---------------------------------------------------------------------*
END-OF-SELECTION.
*---------------------------------------------------------------------*
