*&---------------------------------------------------------------------*
*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0440                                             &*
*& Title       : [CO] 예산 히스토리 초기화 프로그램_IT팀 전용             &*
*& Created By  : TSKCO2                                             &*
*& Created On  : 2020.01.29                                           &*
*& Description : [CO] 예산 히스토리 초기화 프로그램_IT팀 전용           &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2020.01.29  TSKCO2   INITIAL RELEASE
*----------------------------------------------------------------------*
REPORT ZCOR0440 MESSAGE-ID ZCO01.

*----------------------------------------------------------------------*
* INCLUDE
*----------------------------------------------------------------------*
INCLUDE ZCOR0440T01.
INCLUDE ZCOR0440SCR.
INCLUDE ZCOR0440ALV.
INCLUDE ZCOR0440F01.


*----------------------------------------------------------------------*
INITIALIZATION.
*----------------------------------------------------------------------*
  PERFORM INITIAL_SET.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*---------------------------------------------------------------------*
  PERFORM SET_SELSCREEN.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON BLOCK BL1.
*---------------------------------------------------------------------*
* 선택조건 유효성 검증을 하고싶을 경우 해당 block 유효성 체크를 진행하면 됨.
*  PERFORM CHECK_CONTROLLING_AREA

**--------------------------------------------------------------------*
*AT SELECTION-SCREEN ON VALUE-REQUEST FOR PA_PDGR.
**--------------------------------------------------------------------*
*  PERFORM F4_PDGR CHANGING PA_PDGR.     "WBS 그룹

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
* 1. 이전년도는 설정 불가(위배될경우 하단 메세지 처리)
*  PERFORM CHECK_GJAHR.
* 2. 처리전에 진짜로 실행할지 확인 메세지 popup
  IF GV_CHECK_GJAHR NE 'X'.

*      PERFORM POPUP_TO_CONFIRM USING TEXT-PT1
*                                     TEXT-QT1.
*
*      CHECK GV_ANSWER = '1'

    .
*      단순 DELETE에서 SELECT 후 SCREEN 에서 선택 제거로 변경
*      PERFORM ENQUE_LOCK.
*      PERFORM DELETE_DATA_RTN.
*      PERFORM DEQUE_LOCK.
*      MESSAGE S000 WITH TEXT-S01.
      PERFORM MAKE_TABLE.
      PERFORM SELECTED_DATA_RTN.
      PERFORM SALV_CALL.

  ENDIF.
