*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0320                                             &*
*& Title       : [CO] 사용자 권한관리                                 &*
*& Created By  : ZCOR0320                                             &*
*& Created On  : 2019.09.04                                           &*
*& Description : [CO] 사용자 권한관리                                 &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2019.09.04  BSGABAP8    INITIAL RELEASE
*----------------------------------------------------------------------*
REPORT ZCOR0320 MESSAGE-ID ZCO01.

INCLUDE ZCOR0320T01.    "Top
INCLUDE ZCOR0320ALV.    "Alv
INCLUDE ZCOR0320SCR.    "Screen - Condition screen
INCLUDE ZCOR0320O01.    "Process Befor Output
INCLUDE ZCOR0320I01.    "Process After Input
INCLUDE ZCOR0320F01.    "Form

*---------------------------------------------------------------------*
INITIALIZATION.
*---------------------------------------------------------------------*
  PERFORM INITAIL.
  PERFORM SET_INIT_HELP.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND_HELP.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*---------------------------------------------------------------------*
  PERFORM SET_SCREEN.

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
  PERFORM SELECTED_DATA_RTN.
  CALL SCREEN 0100.
