*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0280                                             &*
*& Title       : [CO] WBS 계획 수정                                   &*
*& Created By  : BSGABAP8                                             &*
*& Created On  : 2019.08.27                                           &*
*& Description : [CO] WBS 계획 수정                                   &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2019.08.27  BSGABAP8    INITIAL RELEASE
* U   2021.03.25  BSGSM_FCM    CBO 권한 체크 추가
*----------------------------------------------------------------------*
REPORT zcor0280 MESSAGE-ID zco01.

INCLUDE zcor0280t01.    "Top
INCLUDE zcor0280alv.    "Alv
INCLUDE zcor0280scr.    "Screen - Condition screen
INCLUDE zcor0280o01.    "Process Befor Output
INCLUDE zcor0280i01.    "Process After Input
INCLUDE zcor0280f01.    "Form

*---------------------------------------------------------------------*
INITIALIZATION.
*---------------------------------------------------------------------*
  PERFORM initail.
  PERFORM set_init_help.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM scr_user_command_help.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*---------------------------------------------------------------------*
  PERFORM set_screen.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR pa_pdgr.
*---------------------------------------------------------------------*
  PERFORM f4_pdgr CHANGING pa_pdgr.     "WBS 그룹

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON BLOCK bl1.
*---------------------------------------------------------------------*
  PERFORM check_bl1.

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
  PERFORM selected_data_rtn.
  CALL SCREEN 0100.
