*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0530                                             &*
*& Title       : [CO] 설비분류코드 업로드                             &*
*& Created By  : MDP_06                                               &*
*& Created On  : 2021.09.14                                           &*
*& Description : [CO] 설비분류코드 업로드                             &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2021.09.14  MDP_06      INITIAL RELEASE
*----------------------------------------------------------------------*

REPORT ZCOR0530 MESSAGE-ID ZCO01.

INCLUDE ZCOR0530T01.   " TOP-Decration
INCLUDE ZCOR0530ALV.   " Class ALV OR Others
INCLUDE ZCOR0530SCR.   " Selection-Screen
INCLUDE ZCOR0530F01.   " Subroutine
INCLUDE ZCOR0530PBO.   " Process Before Output
INCLUDE ZCOR0530PAI.   " Process After  Input


*---------------------------------------------------------------------*
INITIALIZATION.
*---------------------------------------------------------------------*
  PERFORM INITIALIZATION.
  PERFORM SCRFIELDS_FUNCTXT.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*---------------------------------------------------------------------*
  PERFORM MODIFY_SSCR.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND. "양식 Download

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR PA_FILE.
*---------------------------------------------------------------------*
  PERFORM F4_FILE CHANGING PA_FILE.

*---------------------------------------------------------------------*
START-OF-SELECTION.
*---------------------------------------------------------------------*
  PERFORM SELECTED_DATA_RTN.

*---------------------------------------------------------------------*
END-OF-SELECTION.
*---------------------------------------------------------------------*
  CALL SCREEN 0100.
