*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0040                                             &*
*& Title       : [CO] 예산기준정보 관리                               &*
*& Created By  : BSGABAP4                                             &*
*& Created On  : 2019.06.18                                           &*
*& Description : [CO] 예산기준정보 관리                               &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2019.06.18  BSGABAP4    INITIAL RELEASE
* N    2021.08.23   ZCOR0040B 백업
**                  ZCOR0040B, ZCOR0041B 티코드생성
*----------------------------------------------------------------------*

REPORT ZCOR0040B MESSAGE-ID ZCO01.

*----------------------------------------------------------------------*
* INCLUDE
*----------------------------------------------------------------------*
INCLUDE ZCOR0040BT01.
*INCLUDE ZCOR0040T01.    "Top
INCLUDE ZCOR0040BALV.
*INCLUDE ZCOR0040ALV.    "Alv
INCLUDE ZCOR0040BSCR.
*INCLUDE ZCOR0040SCR.    "Screen - Condition screen
INCLUDE ZCOR0040BO01.
*INCLUDE ZCOR0040O01.    "Process Befor Output
INCLUDE ZCOR0040BI01.
*INCLUDE ZCOR0040I01.    "Process After Input
INCLUDE ZCOR0040BF01.
*INCLUDE ZCOR0040F01.    "Form

*----------------------------------------------------------------------*
INITIALIZATION.
*----------------------------------------------------------------------*
  PERFORM INITIAL_SET.
  PERFORM SCRFIELDS_FUNCTXT.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON BLOCK BL1.
*---------------------------------------------------------------------*
  PERFORM CHECK_CONTROLLING_AREA.

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
  PERFORM SELECTED_DATA_RTN.
  CALL SCREEN 0100.

*----------------------------------------------------------------------*
END-OF-SELECTION.
*----------------------------------------------------------------------*
