*&--------------------------------------------------------------------&*
*& PROGRAM ID  : ZCOR0050                                             &*
*& Title       : [CO] 예산기준 정보 관리_코스트센터, WBS              &*
*& Created By  : BSGABAP4                                             &*
*& Created On  : 2019.06.24                                           &*
*& Description : [CO] 예산기준 정보 관리_코스트센터, WBS               &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2019.06.24  BSGABAP4    INITIAL RELEASE
* N    ZCOR0050   BACKUP
*----------------------------------------------------------------------*
REPORT ZCOR0050B MESSAGE-ID ZCO01.

*----------------------------------------------------------------------*
* INCLUDE
*----------------------------------------------------------------------*
INCLUDE ZCOR0050BT01.
*INCLUDE ZCOR0050T01.    "Top
INCLUDE ZCOR0050BALV.
*INCLUDE ZCOR0050ALV.    "Alv
INCLUDE ZCOR0050BSCR.
*INCLUDE ZCOR0050SCR.    "Screen - Condition screen
INCLUDE ZCOR005OBO01.
*INCLUDE ZCOR0050O01.    "Process Befor Output
INCLUDE ZCOR0050BI01.
*INCLUDE ZCOR0050I01.    "Process After Input
INCLUDE ZCOR0050BF01.
*INCLUDE ZCOR0050F01.    "Form

*----------------------------------------------------------------------*
INITIALIZATION.
*----------------------------------------------------------------------*
  PERFORM INITIAL_SET.
  PERFORM SCRFIELDS_FUNCTXT.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON BLOCK BL1.
*---------------------------------------------------------------------*
  PERFORM CHECK_CONTROLLING_AREA.

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
  PERFORM SELECTED_DATA_RTN.
  CALL SCREEN 0100.

*----------------------------------------------------------------------*
END-OF-SELECTION.
*----------------------------------------------------------------------*
