*&--------------------------------------------------------------------&*
*& PROGRAM ID  :  ZCOR0480                                            &*
*& Title : [CO] 결산 시점  생판 수량과  조회시 생판수량 대사          &*
*& Created By  :  BSGSM_FCM                                           &*
*& Created On  : 2021.01.22                                            &*
*& Description :                                                      &*
*----------------------------------------------------------------------*
* MODIFICATION LOG
*----------------------------------------------------------------------*
* Tag  Date.       Author.     Description.
*----------------------------------------------------------------------*
* N    2021.01.22  BSGSM_FCM    INITIAL RELEASE
*----------------------------------------------------------------------*

REPORT  ZCOR0480  MESSAGE-ID ZO01.
INCLUDE ZCOR0480T01.
INCLUDE ZCOR0480CLS.
INCLUDE ZCOR0480SCR.
INCLUDE ZCOR0480O01.
INCLUDE ZCOR0480I01.
INCLUDE ZCOR0480F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR PA_MONTH.
*---------------------------------------------------------------------*
  PERFORM F4_P_MONTH.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*---------------------------------------------------------------------*
AT SELECTION-SCREEN ON BLOCK BL1.
*---------------------------------------------------------------------*
  PERFORM CHECK_BL1.

AT SELECTION-SCREEN.
*---------------------------------------------------------------------*
  PERFORM SCR_USER_COMMAND.


************************************************************************
*START-OF-SELECTION.
************************************************************************
START-OF-SELECTION.
*

  IF  PA_MONTH < '202007' AND ( SY-SYSID = 'TCQ' OR  SY-SYSID = 'TCP' ).

**20년 7월 이전 조회 불가

    GV_EXIT = 'X'.
    MESSAGE S000 WITH  TEXT-E77..

  ELSE.


    CLEAR GV_EXIT.
    PERFORM CHECK_AUTH_COND.

    CHECK GV_EXIT IS INITIAL.
    PERFORM GET_DATA.
  ENDIF.

************************************************************************
*END-OF-SELECTION.
************************************************************************
END-OF-SELECTION.

  CALL SCREEN 100.
